hussainaloum/STM32-Embedded-Drivers/drivers/inc/stm32f439zi_i2c_driver.h
/*
 * stm32f439zi_i2c_driver.h
 *
 *  Created on: Nov 19, 2021
 *      Author: ha
 */

#ifndef INC_STM32F439ZI_I2C_DRIVER_H_
#define INC_STM32F439ZI_I2C_DRIVER_H_

#include "stm32f439zi.h"

typedef struct
{
	uint32_t	I2C_SCLSpeed;
	uint8_t		I2C_DeviceAddress;				//The user will mention the device address
	uint8_t		I2C_ACKControl;
	uint8_t		I2C_FMDutyCycle;
}I2C_Config_t;

typedef struct
{
	I2C_Config_t	I2C_Config;
	I2C_RegDef_t	*pI2Cx;
	uint8_t 		*pTxBuffer; /* !< To store the app. Tx buffer address > */
	uint8_t 		*pRxBuffer;	/* !< To store the app. Rx buffer address > */
	uint32_t 		TxLen;		/* !< To store Tx len > */
	uint32_t 		RxLen;		/* !< To store Tx len > */
	uint8_t 		TxRxState;	/* !< To store Communication state > */
	uint8_t 		DevAddr;	/* !< To store slave/device address > */
    uint32_t        RxSize;		/* !< To store Rx size  > */
    uint8_t         Sr;			/* !< To store repeated start value  > */
}I2C_Handle_t;

/*
 * I2C application states
 */
#define I2C_READY 					0
#define I2C_BUSY_IN_RX 				1
#define I2C_BUSY_IN_TX 				2

/* I2C serial clock speed @I2C_SCLSpeed */
#define I2C_SCL_SPEED_SM		100000			//Standard mode
#define I2C_SCL_SPEED_FM2K		200000			//Fast mode 200KHz
#define I2C_SCL_SPEED_FM4K		400000			//Fast mode 400KHz

/* I2C Acknowledge control @I2C_ACKControl */
#define I2C_ACK_ENABLE			ENABLE
#define I2C_ACK_DISABLE			DISABLE

/* I2C Duty cycle @I2C_FMDutyCycle */
#define I2C_FM_DUTY_2			0
#define I2C_FM_DUTY_16_9		1

/* I2C related status flags definitions */
#define I2C_FLAG_TXE				(1 << I2C_SR1_TXNE_BIT_POS)
#define I2C_FLAG_RXNE				(1 << I2C_SR1_RXNE_BIT_POS)
#define I2C_FLAG_SB					(1 << I2C_SR1_SB_BIT_POS)
#define I2C_FLAG_ADDR				(1 << I2C_SR1_ADDR_BIT_POS)
#define I2C_FLAG_BTF				(1 << I2C_SR1_BTF_BIT_POS)
#define I2C_FLAG_STOPF				(1 << I2C_SR1_STOPF_BIT_POS)
#define I2C_FLAG_BERR				(1 << I2C_SR1_BERR_BIT_POS)
#define I2C_FLAG_ARLO				(1 << I2C_SR1_ARLO_BIT_POS)
#define I2C_FLAG_AF					(1 << I2C_SR1_AF_BIT_POS)
#define I2C_FLAG_OVR				(1 << I2C_SR1_OVR_BIT_POS)
#define I2C_FLAG_TIMEOUT			(1 << I2C_SR1_TIMEOUT_BIT_POS)

#define I2C_DISABLE_SR  	RESET
#define I2C_ENABLE_SR   	SET


/*
 * I2C application events macros
 */
#define I2C_EV_TX_CMPLT  	 	0
#define I2C_EV_RX_CMPLT  	 	1
#define I2C_EV_STOP       		2
#define I2C_ERROR_BERR 	 		3
#define I2C_ERROR_ARLO  		4
#define I2C_ERROR_AF    		5
#define I2C_ERROR_OVR   		6
#define I2C_ERROR_TIMEOUT 		7
#define I2C_EV_DATA_REQ         8
#define I2C_EV_DATA_RCV         9

/**************************************
 	 APIs supported by this I2C driver
 **************************************/
/* Peripheral Enable or Disable */
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi);

/* Peripheral Clock Setup */
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t ENorDi);


/* Init and De-Init */
void I2C_Init(I2C_Handle_t *pI2CHandle);
void I2C_DeInit(I2C_RegDef_t *pI2Cx);

/*
 * Data send and receive
 * */
void I2C_MasterSendData(I2C_Handle_t *pI2CHandle,uint8_t *pTxbuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t Sr);
void I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxbuffer, uint32_t Len, uint8_t SlaveAddrs, uint8_t Sr);

/*
 * IRQ Configuration and ISR handling
 * */
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void I2C_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);

/*
 * Application Callback
 * */
void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEv);

/*
 * Other Peripheral control APIs
 * */
bool I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t FlagName);
void I2C_ManageAcking(I2C_RegDef_t *pI2Cx, uint8_t EnorDi);
void I2C_CloseReceiveData(I2C_Handle_t *pI2CHandle);

#endif /* INC_STM32F439ZI_I2C_DRIVER_H_ */
